init.org
#+TITLE: My Emacs configuration
#+OPTIONS: toc:4 h:4 
#+STARTUP: showeverything
#+PROPERTY: header-args:emacs-lisp   :tangle "~/.emacs.d/init_gen.el"


* Configuration
** About this file

My personal Emacs config, taking a single file literate approach, inspired by [[https://raw.githubusercontent.com/sachac/.emacs.d/gh-pages/Sacha.org][Sacha Chua]].

The following are directly from her config, to remind me how to work with this until I get used to it: 

#+BEGIN_QUOTE
If you're viewing the Org file, you can open source code blocks (those
are the ones in begin_src) in a separate buffer by moving your point
inside them and typing C-c ' (=org-edit-special=). This opens another
buffer in =emacs-lisp-mode=, so you can use =M-x eval-buffer= to load
the changes. If you want to explore how functions work, use =M-x
edebug-defun= to set up debugging for that function, and then call it.
You can learn more about edebug in the [[http://www.gnu.org/software/emacs/manual/html_node/elisp/Edebug.html][Emacs Lisp]] manual.

My =~/.emacs.d/init.el= is now a symlink to =Sacha.el=, which is what
=M-x org-babel-tangle= (=C-c C-v t=) produces. [...] Since I create =Sacha.el= via =org-babel-tangle=, my Emacs
config can load =Sacha.el= without loading Org first.
#+END_QUOTE

My approach is going to be to put my whole current init file in one big code block, and then chip away at documenting it better. 

** Starting up
*** System & personal info

I set this up first, because: 

 - I use Emacs on multiple devices with different operating systems
 - I want different contact info set on work vs. personal machines
 - Some things need to be loaded (or not, or differently) based on the OS

**** Define systems

#+BEGIN_SRC emacs-lisp
(defun personal-laptop ()
  (equal (system-name) "spore"))
(defun work-laptop ()
  (equal (system-name) "Kristina-MBP"))
#+END_SRC

**** Define contact info

Name remains the same. Email changes from personal to work!

#+BEGIN_SRC emacs-lisp
(setq user-full-name "Kristina M. Spurgin")
(when (personal-laptop)
  (setq user-mail-address "kristina@le-champignon.net")
  (message "You are on your personal laptop.")
)
(when (work-laptop)
  (setq user-mail-address "kristina.spurgin@lyrasis.org")
    (message "You are on your work laptop.")
)
#+END_SRC

**** Fix the Mac keyboard 

First, turn off any special OS-related keyboard stuff.

Then set Mac keyboard's left command key to act as meta (i.e. Alt on windows) key.

The right command key still acts as super/command in order to control windows, etc.

#+BEGIN_SRC emacs-lisp
(when (work-laptop)
  (set-keyboard-coding-system nil)
  (setq mac-command-modifier 'meta)
  (setq mac-right-command-modifier 'super)
)
#+END_SRC
*** Where are all the things? 
**** Basics
 First, set up the load path, so it can be overridden. 

 The =package-initialize= call is required before anything below can happen!

 #+BEGIN_SRC emacs-lisp
 (package-initialize)
 #+END_SRC

Use =use-package= to install and configure packages! Here we set up use-package for later use. 

The init settings are largely taken from [[http://pages.sachachua.com/.emacs.d/Sacha.html][Sacha Chua]]. The =use-package= documentation is [[https://github.com/jwiegley/use-package][here]].

#+BEGIN_SRC emacs-lisp
(unless (package-installed-p 'use-package)
  (package-install 'use-package))
(setq use-package-verbose t)
(require 'use-package)
(use-package auto-compile
  :ensure t
  :config (auto-compile-on-load-mode))
(setq load-prefer-newer t)
(message "use-package is set up now")
#+END_SRC
**** Set up package sources

These are the external repos from which =use-package= gets packages. 

#+BEGIN_SRC emacs-lisp 
(unless (assoc-default "melpa" package-archives)
  (add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t)
  (package-refresh-contents))
(unless (assoc-default "org" package-archives)
  (add-to-list 'package-archives '("org" . "https://orgmode.org/elpa/") t)
  (package-refresh-contents))
(message "Loaded package sources")
#+END_SRC
**** Personal code sources
Stuff from outside the package system. Add locations to =load-path= so Emacs can find them.

#+BEGIN_SRC emacs-lisp
(add-to-list 'load-path "~/.emacs.d/lisp")
(add-to-list 'custom-theme-load-path "~/.emacs.d/themes")
#+END_SRC

Load appropriate macros, depending on device.

#+BEGIN_SRC emacs-lisp
(when (work-laptop)
       (load "LYRASIS_macros")
       (message "work-related macros loaded"))
#+END_SRC
** Appearance/UI

Make the graphical client dark and pretty.

#+BEGIN_SRC emacs-lisp
(cond ((display-graphic-p)
       (use-package darktooth-theme
	 :ensure t)
       (load-theme 'darktooth t)
       (message "loaded theme")
       ))
#+END_SRC
** General behavior

Save the desktop automatically. When you start up again, load the (local) buffers you had open when you closed Emacs. (It won't keep Tramp buffers open, unfortunately.

Certain types of buffers are not important and we don't want them saved/reopened.

#+BEGIN_SRC emacs-lisp
(desktop-save-mode 1)
(add-to-list 'desktop-globals-to-save 'file-name-history)
(setq desktop-restore-frames t) ;;doesn't seem to work, at least on Ubuntu.
(setq desktop-buffers-not-to-save
     (concat "\\(" "^nn\\.a[0-9]+\\|\\.log\\|(ftp)\\|^tags\\|^TAGS"
	        "\\|\\.emacs.*\\|\\.diary\\|\\.newsrc-dribble\\|\\.bbdb"
	        "\\)$"))
(add-to-list 'desktop-modes-not-to-save 'dired-mode)
(add-to-list 'desktop-modes-not-to-save 'Info-mode)
(add-to-list 'desktop-modes-not-to-save 'info-lookup-mode)
(add-to-list 'desktop-modes-not-to-save 'fundamental-mode)
#+END_SRC

Don't ring the error bell at me!

#+BEGIN_SRC emacs-lisp
(setq ring-bell-function 'ignore)
#+END_SRC
** Coding
*** Perl

=cperl-mode= is an enhanced Perl mode.

#+BEGIN_SRC emacs-lisp
(use-package cperl-mode
  :mode "\\.p[lm]\\'"
  :interpreter "perl"
  :config (load "cperl-setup"))
#+END_SRC
*** Ruby

Use enhanced ruby mode. 

I've customized the color of the double/single quote string delimiters because the default was hard to see on a dark background.

#+BEGIN_SRC emacs-lisp
(use-package enh-ruby-mode
  :ensure t
  :mode "\\.rb\\'"
  :interpreter "ruby"
  :custom-face
  (enh-ruby-string-delimiter-face ((t (:foreground "wheat1"))))
  )
#+END_SRC
** Data
*** XML

The following enables folding of XML

From: https://emacs.stackexchange.com/questions/2884/the-old-how-to-fold-xml-question

#+BEGIN_SRC emacs-lisp
(require 'hideshow)
(require 'sgml-mode)
(require 'nxml-mode)
(add-to-list 'hs-special-modes-alist
             '(nxml-mode
               "<!--\\|<[^/>]*[^/]>"
               "-->\\|</[^/>]*[^/]>"

               "<!--"
               sgml-skip-tag-forward
               nil))
(add-hook 'nxml-mode-hook 'hs-minor-mode)
(define-key nxml-mode-map (kbd "C-c h") 'hs-toggle-hiding)

#+END_SRC
*** YAML

#+BEGIN_SRC emacs-lisp
(use-package yaml-mode
  :ensure t
  :mode (("\\.yml\\'" . yaml-mode)
	 ("\\.yaml\\'" . yaml-mode))
  )
#+END_SRC
** Org-mode
#+BEGIN_SRC emacs-lisp
(use-package org
  :ensure t
  )

#+END_SRC
*** TODO comment/organize this better
    :LOGBOOK:
    - State "TODO"       from              [2019-10-22 Tue 22:49]
    :END:

** Productivity
*** Abbrevs

Abbrevs are documented [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Abbrevs.html][in the Emacs manual]]. I still have not figured out the best way to use them, and invariably they become annoying.

#+BEGIN_SRC emacs-lisp :tangle no
;; turn on abbrev mode globally
(setq-default abbrev-mode t)
(load "my_abbrevs")
;; stop asking whether to save newly added abbrev when quitting emacs
(setq save-abbrevs nil)

#+END_SRC
*** Ivy

=ivy= is a generic completion framework in the minibuffer. Replaces built-in =ido= functionality.

[[https://oremacs.com/swiper/][Ivy manual]]

I'm trying this out, as of <2019-10-22 Tue>

Setting =ivy-intial-inputs-alist= to nil turns off the default behavior of starting filters with =^=.
#+BEGIN_SRC emacs-lisp
(use-package ivy
  :ensure t
  :diminish ivy-mode
  :config
  (ivy-mode t)
  (setq ivy-initial-inputs-alist nil)
)
#+END_SRC

[[https://github.com/abo-abo/swiper/wiki][Ivy/Swiper wiki]] hosts "cool code snippets that you can use once you’re experienced with Elisp and ivy."
*** Counsel

=counsel= is a collection of =ivy= enhanced versions of common Emacs commands.

#+BEGIN_SRC emacs-lisp
(use-package counsel
    :ensure t
    :bind (("M-x" . counsel-M-x))
)
#+END_SRC
*** Swiper

The quotes are from [[https://truthseekers.io/lessons/how-to-use-ivy-swiper-counsel-in-emacs-for-noobs/][here]].

#+BEGIN_QUOTE
Swiper helps you search through emacs, and shows you text around the matching terms. It turns out Ivy is actually required for Swiper to work. If you install Swiper, Ivy gets installed as a dependency.
#+END_QUOTE

#+BEGIN_SRC emacs-lisp
(use-package swiper
  :ensure t
  :bind (("C-s" . swiper)))
#+END_SRC

#+BEGIN_QUOTE
Now, you can search through Emacs using Swiper. When you run =C-s= the swiper search will be used instead of isearch. When you search you can use the same regular expression Ivy has to find a specific result you’re looking for.
#+END_QUOTE

[[https://github.com/abo-abo/swiper/wiki][Ivy/Swiper wiki]] hosts "cool code snippets that you can use once you’re experienced with Elisp and ivy."
*** Projectile
#+BEGIN_QUOTE
Projectile is a project interaction library for Emacs. Its goal is to provide a nice set of features operating on a project level without introducing external dependencies (when feasible). --[[https://projectile.readthedocs.io/en/latest/][Projectile docs]]
#+END_QUOTE

#+BEGIN_SRC emacs-lisp
(use-package projectile
  :ensure t
  :config
  (define-key projectile-mode-map (kbd "s-p") 'projectile-command-map)
  (define-key projectile-mode-map (kbd "C-c p") 'projectile-command-map)
  (projectile-mode +1)
  (setq projectile-completion-system 'ivy))
#+END_SRC
**** TODO Read up on Projectile and configure
     :LOGBOOK:
     - State "TODO"       from              [2019-10-22 Tue 22:27]
     :END:
https://projectile.readthedocs.io/en/latest/usage/
*** Other
#+BEGIN_SRC emacs-lisp
(use-package visual-regexp-steroids
  :ensure t
  :ensure visual-regexp
  :bind (("C-c r" . vr/replace)
	 ("C-c q" . vr/query-replace)
	 ("C-M-R" . vr/isearch-backward)
	 ("C-M-S" . vr/isearch-forward))
  )

(use-package yasnippet
  :ensure t
  :config (yas-global-mode 1)
  )
#+END_SRC
**** TODO comment/organize this better
** Publishing
*** AsciiDoc
When I can't write in/publish from =org-mode=, AsciiDoc is my text markup language of choice. In some ways I even prefer it to =org-mode=! (Admonition blocks, ToCs rendered in github, includes!). [[https://asciidoctor.org/docs/what-is-asciidoc/][More on why it is great...]]

[[https://asciidoctor.org/docs/asciidoc-writers-guide/][In-depth writer's guide]] -- [[https://asciidoctor.org/docs/asciidoc-syntax-quick-reference/][Quick reference]]

#+BEGIN_SRC emacs-lisp
(use-package adoc-mode
  :ensure t
  :mode (("\\.adoc\\'" . adoc-mode))
  )
#+END_SRC

*** LaTeX

Currently I only am using this at work.

#+BEGIN_SRC emacs-lisp
(when (work-laptop)
       (setenv "PATH" (concat (getenv "PATH") ":/usr/local/texlive/2019/bin/x86_64-darwin"))
	(add-to-list'exec-path "/usr/local/texlive/2019/bin/x86_64-darwin"))
#+END_SRC
*** Markdown

For editing Markdown text. 

#+BEGIN_SRC emacs-lisp
(use-package markdown-mode
  :ensure t
  :commands (markdown-mode gfm-mode)
  :mode (("README\\.md\\'" . gfm-mode)
         ("\\.md\\'" . markdown-mode)
         ("\\.markdown\\'" . markdown-mode))
  :init (setq markdown-command "multimarkdown"))
#+END_SRC
