init.org
*** Org-mode export

=auto-org-md= is a simple package that exports a markdown file automatically when you save an org file. [[https://github.com/jamcha-aa/auto-org-md][github]]

#+BEGIN_SRC emacs-lisp
(use-package auto-org-md
  :ensure t
)
#+END_SRC
** Version control

Try =magit= again. Manual is [[https://magit.vc/manual/magit/index.html#Top][here]].

#+BEGIN_SRC emacs-lisp
(use-package magit
  :ensure t
  :bind (("C-x g" . magit-status)))
#+END_SRC

This is supposed to be neat: it will let you step back in time through your changes. But I don't want to mess with it until I'm used to =magit=.

#+BEGIN_SRC emacs-lisp :tangle no
(use-package git-timemachine
  :ensure t
  :bind (("s-g" . git-timemachine)))
#+END_SRC
